"""программа для выявления нарушений ценообразования"""

"алгоритм"

"на вход подается файл с себестоимостью"
"на вход подается файл с фактической стоимостью"
"питон должен выделить позицию из файла с себестоимостью его название и цену, можно сделать списком или словарем ф=[cola, 25] или a = {cola: 25}"
"питон должен выделить идентичную позицию по названию позиции и его цену из файла с факт ценой ф=[cola, 100] нужно чтобы он сравнивал одну и ту же позицию"
"можно определить к какой категории относится эта позиция (напитки, еда, косметика, парфюм) ( для этого необходимо сделать словарь {drinks: cola, fanta ... ,food: sandwich, lays ... , parfume: lacoste, armani ...}
"Питон должен выделить значение цены которое соответсвует этой позиции из первого файла и второго файла"
"алгоритм вычисляет уровень наценки относительно себестоимости"
"сравнивает значение наценки с допустимой наценкой по определенной категории товаров"
"в случае выявления превышения более (10%) или сильного занижения (более 15%) выдает запись с информацией о том кто меняет цену, на сколько и на какой товар"
"нужен ли интерфейс?"
"Можно сделать бота который будет просить оба файла и в конце ответом давать выявленные нарушения. "
"можно сделать вывод отдельного окна в котором будет сформирована таблица нарушений"



"так как некоторые арендаторы ведут учет цен в тетради нужно сделать так, чтобы на вход можно было подать картинку и смог читать текст с картинки"
#  import cv2
#  import pytesseract
"чтение с экселя"
"import pandas as pd"




















